using System;

namespace Tack_0
{
    class Program
    {
        static void Main(string[] args)
        {   
//                 string str = "Привет!";
// Console.while ("Введите целое число: ");
// int num = Convert.ToInt32(Console.ReadLine());
int num = 4;
int res = num * num;
Console.WriteLine(res);
// Console.WriteLine($"Квадрат числа {num} = {res}");
        }
    }
}
/*Напишите программу, которая на вход
принимает число и выдаёт его квадрат (число
умноженное на само себя)
4 -> 16
-3 -> 9
-7 -> 49
*/
